---
kind: type
id: T:Autodesk.Revit.DB.Architecture.StairsLanding
source: html/cae109cd-bc50-6c36-300e-35d3457c0982.htm
---
# Autodesk.Revit.DB.Architecture.StairsLanding

An object that represents a stairs landing in Autodesk Revit.

## Syntax (C#)
```csharp
public class StairsLanding : Element
```